// task 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let task1 = '';
for (let i = 20; i <= 30; i = i + 0.5) {
    task1 += i + " ";
}
console.log(task1);

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
let task2 = '';
let rate = 27;
for (let i = 10; i <= 100; i += 10) {
    {
        task2 += i * rate + " "
    }
}
console.log(task2);

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let nmb = 280;
let task3 = '';
for (let i = 1; i <= 100; i++) {
    if (i ** 2 <= nmb) {
        task3 += i + ' ';
    }
}
console.log(task3);
// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let nmb2 = 20;
for (let i = 2; i < nmb2; i++) {
    if (nmb2 % i === 0) {
        console.log('це не просте число')
        break
    }
    else {
        console.log('це просте число')
        break
        // не знаю правильно ли употребила брейки, но все работает
    }
}

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
let nmb3 = 27;
for (let i = 0; i < nmb3; i++) {
    if (3 ** i == nmb3) {
        console.log("possible");
        break;
    }
    if (3 ** i > nmb3) {
        console.log("impossible");
        break;
    }
}
